
//сканирует все узлы обмена включая план обмена ИнтеграцияСДокументооборотом
//и формирует Zabbix соответствующий элемент данных для мониторинга 
//состояния обмена
//у интеграции с документооборотом есть особенность
//у данного плана нет внешних узлов и очереди сообщений
//контроль работы ведется запросом
//"ВЫБРАТЬ
//|	КОЛИЧЕСТВО(РС.СсылкаНаОбъект) КАК КоличествоНеОтправленных
//|ИЗ
//|	РегистрСведений.СостоянияСогласованияВДокументообороте КАК РС
//|ГДЕ
//|	РС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласованияВДокументообороте.Подготовлен)"
//поэтому для него элемент создается по узлу ЭтотУзел.
Процедура ФормированиеЭлементовДанныхZabbix() Экспорт
	обработкаМониторингОбменов = Обработки.МониторингОчередиСообщенийВПланеОбмена.Создать();
	обработкаМониторингОбменов.СформироватьЭлементыДанныхZabbix();
КонецПроцедуры
