//выполняет выборку количества не отправленных сообщений
//по заданному узлу обмена
Функция exchangeget(Запрос)
	ответ = Новый HTTPСервисОтвет(200);
	Если СтрНайти(Запрос.ПараметрыURL.Получить("*"), "MessageCount") > 0 Тогда
		//вызов метода запроса количества не отправленных сообщений
		
		идУзла = Запрос.ПараметрыЗапроса.Получить("id");
		//	GUID ПланОбмена.Интеграция1СДокументооборот	 GUID ЭтотУзел()
		//example:43de0f9f-e04d-4c0e-bd44-1ee8ff42dfcd_0aeb91a9-095a-472c-a674-0f2f468de53d
		//                                             |

		Если идУзла = Неопределено Тогда
			ВызватьИсключение "Не передан идентификатор узела обмена для мониторинга.";
		КонецЕсли;
		
		обработкаМониторингОбмена = Обработки.МониторингОчередиСообщенийВПланеОбмена.Создать();
		колНеОтправленных = обработкаМониторингОбмена.ВыполнитьАнализОчередиПоКлючуУзла(идУзла);
		
		ответ.Заголовки.Вставить("Content-Type","application/json");
		ответ.УстановитьТелоИзСтроки("{""MessageCount"":"""+XMLСтрока(колНеОтправленных)+"""}");
	Иначе
		ВызватьИсключение "Медот не найден. HTTP Service 1C БСХП <ExchangeMonitoring>";
	КонецЕсли;
	
	Возврат ответ;
КонецФункции
