&НаСервере
Процедура КомандаПрочитатьНастройкиНаСервере()
	обработкаОбъект = РеквизитФормыВЗначение("Объект");
	настройки = обработкаОбъект.ПолучитьНастройкиМониторингаОбменов();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, настройки);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрочитатьНастройки(Команда)
	КомандаПрочитатьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСохранитьНастройкиНаСервере()
	обработкаОбъект = РеквизитФормыВЗначение("Объект");
	настройки = обработкаОбъект.СтруктураНастроекМониторнигаОбменов();
	ЗаполнитьЗначенияСвойств(настройки, ЭтаФорма);
	обработкаОбъект.СохранитьНастройкиМониторингаОбменов(настройки);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	КомандаСохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере        
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомандаПрочитатьНастройкиНаСервере();
КонецПроцедуры
